<template>
    <div style="background-color:#fff;padding-top:20px;width:100%">
        <div style="font-size:16px;color:#000;font-weight:bold;margin-left:4%">
            <p>甲方： {{data.company}}</p><br>
            <p>法定代表人：{{data.legal_person}}</p><br><br>
            <p>乙方：上海晟荣企业咨询有限公司</p><br>
            <p>法定代表人：丁蕴珏</p><br>
        </div>
        <div style="background-color:#fff;width:100%">
        <div style="background-color:#fff;font-size:14px;color:#000;width:92%;margin-left:4%;padding-top:20px;margin-top:22px;border-top:#E5E5E5 1px solid;padding-bottom:20px;border-bottom:#E5E5E5 1px solid;">
            鉴于，<br><br>
本协议由同意并承诺遵守本协议规定使用【嘻格格】[是否确定：嘻格格]服务的法律实体（以下简称“商户”或“甲方”）与上海晟荣企业咨询有限公司（以下简称“【嘻格格】”或“乙方”）共同缔结，本协议具有协议效力。<br>
如您使用平台账号访问【嘻格格】平台或以其他方式使用或接受【嘻格格】的任何服务，即视为您已阅读并与【嘻格格】达成协议，自愿接受本协议条款及平台所有规则的所有内容的约束。所有服务规则视为本条款不可分割的一部分，与本条款具有同等法律效力。<br><br>

第1条 协议内容及生效<br><br>

1.1 本协议内容包括协议正文、协议附件及所有【嘻格格】已经发布的或将来可能发布的各类规则。所有规则、附件为协议不可分割的一部分，与协议正文具有同等法律效力。<br><br>

1.2 商户在使用【嘻格格】提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。【嘻格格】有权根据需要不时地制定、修改本协议或各类规则，如本协议有任何变更，【嘻格格】将在微信服务平台上以公示形式通知予商户。如商户不同意相关变更，必须立即以书面通知乙方的方式中止或终止本协议，否则视为接受。任何修订和新规则一经公布即自动生效，成为本协议的一部分。登录或继续使用服务将表示商户接受经修订的协议。除另行明确声明外，任何使服务范围扩大或功能增强的新内容均受本协议约束。<br><br>

1.3 商户签署或在线接受本协议并不导致本协议立即生效，经过【嘻格格】审核通过并向商户发出服务开通通知时，本协议即在商户和【嘻格格】之间产生法律效力。<br><br>

第2条 定义<br><br>

“【嘻格格服务平台】”：指由【技术提供方】提供技术支持和服务的微信服务平台。微信服务平台是一种不需要下载安装即可使用的应用，用户通过手机端微信扫一扫或者搜一下即可打开应用。<br><br>

“【嘻格格服务平台】”：指属于【嘻格格】用于供商户、用户发布或查询商品信息，进行信息交流，达成交易意向及向用户提供其他与交易有关的辅助信息服务的微信服务平台。<br><br>

“商户及商户注册”：商户必须是符合《平台审核要求》规定的法律实体（如为续签商户，则仍遵照上一年度《平台审核要求》执行，但续签商户后期新增品牌参照当年度《平台审核要求》执行），如无经营资格或违反本协议第五条之声明与保证的组织不当注册为【嘻格格】商户或超越其民事权利或行为能力范围从事交易的，其与【嘻格格】之间的协议自始无效，一经发现，【嘻格格】有权立即注销该商户【嘻格格】服务账户，并追究其使用【嘻格格】服务的一切法律责任。<br><br>

商户注册是指商户登陆【嘻格格】服务平台，按要求填写相关信息，且在线阅读并确认接受或书面签署本协议以最终激活其【嘻格格】服务账户的过程。<br><br>

“【嘻格格】服务账户”：即商户完成商户注册流程而获得的其将在使用服务的过程中必须与自设的账户密码共同使用的用户名，又称“【嘻格格】用户名”。商户应妥善保管其【嘻格格】服务账户及密码信息，商户不得以任何形式擅自转让或授权他人使用自己的【嘻格格】服务账户；<br><br>

“服务”：是指由乙方在【嘻格格】服务平台向商户提供的互联网信息发布、商业推广及与此有关的互联网技术服务。具体服务内容如下：<br><br>

（1）网络信息服务：指【嘻格格】提供的商户根据本协议的规定利用【嘻格格】服务平台平台查询商品及服务信息、发布商品及服务信息、作为卖方与其它用户订立商品买卖协议与服务提供协议、参加【嘻格格】有关活动以及其他由【嘻格格】同意提供的信息服务；<br><br>

（2）积分推广服务：指由【嘻格格】向商户提供的通过【嘻格格】服务平台平台实施的商业推广服务，具体规定以平台公布规则为准。<br><br>

（3）其他服务：具体服务项目以双方签署补充协议确定。<br><br>

乙方保留在任何时候自行决定对服务及其相关功能、应用软件变更、升级的权利。乙方进一步保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件服务的提供，除非乙方另有说明，否则仍适用本协议。服务随时可能因乙方的单方判断而被增加或修改，或因定期、不定期的维护而暂缓提供，商户将会得到相应的变更通知。商户在此同意乙方在任何情况下都无需向其或第三方在使用服务时对其在传输或联络中的迟延、不准确、错误或疏漏及因此而致使的损害负责。<br><br>

“【嘻格格】服务条款”：由双方另行签署的确认与本协议服务有关的各项个性化规定的契约文件。如【嘻格格】服务条款内容与本协议内容存在冲突，以【嘻格格】服务条款内容为准。<br><br>

第三条 证明文件提交<br><br>

3.1 证明文件提交：商户欲使用本协议下服务，必须根据《平台审核要求》的要求向【嘻格格】或【嘻格格】指定合作方提交其在申请服务时应当提供的证明文件或其他相关证明。<br><br>

3.2 证明文件变更的通知：协议期内，上述相关证明文件的任何变更商户都应及时通知【嘻格格】，如上述证明文件变更后导致商户不再符合《平台审核要求》或具备履行本协议的情形出现时，【嘻格格】有权立即终止或中止本协议。<br><br>

3.3 【嘻格格】将对商户的证明文件进行不定时的抽查，并有权在《平台审核要求》的基础上，要求商户提供更多证明文件，商户需按【嘻格格】要求提供。如商户不能提供，则【嘻格格】有权立即终止或中止本协议。<br><br>

3.4 责任条款：商户同意为其未及时的通知或更新其证明文件或其他证明信息承担全部责任，商户保证其向【嘻格格】提供的全部证明文件真实、准确且不存在超过时效问题（即保证所有证明文件在整个协议履行期间都处于有效期内）如因上述原因发生纠纷或被相关国家主管机关处罚，商户应当独立承担全部责任，如给【嘻格格】（包括其合作伙伴、代理人、职员等）造成损失的，商户同意赔偿其全部损失。<br><br>

第四条 申请条件<br><br>

申请使用服务的商户必须同时满足以下条件：<br><br>

4.1 符合《平台审核要求》的具体要求；<br><br>

4.2 提交了本协议第三条约定的相关证明文件并获得【嘻格格】认可。<br><br>

第五条 商户的声明与保证<br><br>

5.1 其符合《平台审核要求》规定的申请条件，且向【嘻格格】提供真实、合法、准确、有效的注册资料，并保证其诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证【嘻格格】及其他用户可以通过上述联系方式与自己进行联系。同时，商户也有义务在相关资料实际变更时及时更新有关注册资料。<br><br>

5.2 其承诺遵守本协议、补充协议等协议以及所有公示于【嘻格格】的规则和流程。<br><br>

5.3 其承诺其通过【嘻格格】发布、编辑、更新的商户信息（包括但不限于文字、图片等）真实准确，并且不侵犯任何人的合法权益。<br><br>

5.4 其承诺在其接受除【嘻格格】基础服务之外的增值服务、推广技术服务时，严格遵守相关服务协议的相关约定。<br><br>

5.5 若商户为商品销售者，则其确认已经仔细阅读、充分理解并自愿遵守网络购买商品七日无理由退货暂行办法之全部规定；若商户为餐饮服务提供者，则其确认已经仔细阅读、充分理解并自愿遵守平台规则之全部规定。所有商户均认可并授权【嘻格格】按照本协议约定、平台规则之规定进行相关争议调解和解决。<br><br>

5.6 其有合法的权利缔结本协议，使用【嘻格格】相关服务。<br><br>

5.7 其发布于【嘻格格】的所有信息真实、准确，符合相关法律法规及【嘻格格】规则。<br><br>

5.8 其对其发布于【嘻格格】的交易信息中所涉商品及服务有合法的销售权。<br><br>

5.9 其保证在使用服务进行交易的过程中遵守诚实信用的原则，不在交易过程中采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。<br><br>

5.10 其保证在使用服务时实施的所有行为均遵守国家法律、法规和【嘻格格】的相关规则、规定以及各种社会公共利益及公共道德。如有违反导致任何法律后果的发生，商户将以自己的名义独立承担所有相应的法律责任。<br><br>

5.11 其同意不对【嘻格格】上任何数据作商业性利用，包括但不限于在未经【嘻格格】事先书面批准的情况下，以复制、传播或向他方披露等方式使用在【嘻格格】服务平台上其他用户展示的任何资料。<br><br>

5.12 其任何在线接受本协议的行为并不当然导致本协议发生法律效力，本协议是附条件生效协议，即必须经过【嘻格格】对其提交的全部资料审核通过且满足本协议约定的生效条件后方可生效。同时，其认可【嘻格格】有权独立的对其入驻资料、品牌经营权限开通申请进行评估、判断。审核结果以【嘻格格】评估、判断为准，其对此不持有任何异议。<br><br>

5.13 其承诺不在发布的商品及服务中使用任何未获授权品牌的关键字。<br><br>

5.14 商户知悉并同意：商家因其经营需要、履行本协议义务而向【嘻格格】提交的任何信息和数据，以及商家在经营过程中产生的交易数据、用户点击、店铺及商品评价数据，【嘻格格】有权在本协议终止后继续保留，同时，无论本协议终止前还是终止之后，【嘻格格】均有权合理使用，使用方式包括但不限于依据数据进行市场分析和调研，或就分析、调研结果以产品形式售卖或免费提供给第三方；商家进一步知悉并同意：该等数据，无论本协议终止前还是终止之后，【嘻格格】均无义务返还商家、也无义务删除原始数据及其备份、同时无义务就使用该数据的行为向商家支付任何费用。<br><br>

5.15 商户承诺与【嘻格格】平台就商户在本平台发布的产品、服务等结算价格不得高于商户相同产品、服务等在其他平台、公开市场的结算价格。<br><br>

第六条 平台的权利及责任<br><br>

6.1 【嘻格格】致力于不断提高商户服务的产品与技术质量、优质的用户体验以及系统的安全稳定；<br><br>

6.2 【嘻格格】在此明确声明对商户服务不作任何明示或暗示的保证，包括但不限于对该服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途之类的保证、声明或承诺。<br><br>

6.3 在所适用的法律允许的范围内，【嘻格格】不做任何明示的或默示的声明，也不给予任何明示的或默示的保证或条件，包括但不限于<br><br>

（1）关于适用性、特定用途适用性、准确性和无侵权行为的任何保证或条件；<br><br>

（2）在服务使用过程或行业惯例中产生的任何保证或条件；<br><br>

（3）在访问或使用商户服务时不受干扰、没有错误的任何保证或条件；<br><br>

（4）在任何书面或者口头的帮助、答疑过程中所作出的陈述、指导或者展示。<br><br>

6.4 在法律允许的最大免责范围内，在任何情况下【嘻格格】均不对源于、基于或因本协议或使用商户服务而导致的数据丢失和/或任何损害赔偿负责，包括但不限于直接的、间接的、特殊的、附带性的或惩罚性的损害赔偿或其他任何形式的损害赔偿，即使【嘻格格】已被告知此等损害赔偿的可能性。<br><br>

6.5 【嘻格格】对商户的任何通知，不论是口头还是书面的，均不表示【嘻格格】承担在本协议陈述以外的任何担保责任。<br><br>

6.6 对下列情形，【嘻格格】在法律允许的最大免责范围内予以免责：<br><br>

（1）并非【嘻格格】的故意或过失而导致服务或者软件、信息无法使用。<br><br>

（2）由于商户或第三人的故意或过失导致其及/或任何第三方遭受损失。<br><br>

（3）因【嘻格格】合理控制范围以外的原因，包括但不限于不可抗力、政府行为和电力电信中断等，导致【嘻格格】未能履行或未能完全履行本协议的。<br><br>

6.7 在法律允许的最大免责范围内，【嘻格格】保留随时修改或中断服务而不需通知商户的权利，不需对商户或任何无直接关系的第三方负责。除非法律另有规定或者双方另有特别约定。<br><br>

6.8 如商户违反本协议第五条约定的承诺及保证，【嘻格格】有权采取一切必要的措施，包括但不限于：删除商户发布的内容、取消虚拟财富，暂停或查封商户帐号，取消因违规所获利益，终止本服务协议，乃至通过诉讼形式追究商户法律责任等。如平台规则中针对特定商户行为有更为严厉的处罚规定，则商户同意【嘻格格】有权根据该更为严厉的处罚规定对涉事商户予以处罚。<br><br>

6.9 如商户在【嘻格格】发布的产品、服务等不符合《平台审核要求》，【嘻格格】有权直接将该不符合要求的产品、服务下架。<br><br>

第七条 知识产权及其它权利<br><br>

7.1 任何商户接受本协议，即表明该商户主动将其在任何时间段在本服务平台发表的任何形式的信息的著作财产权，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权等，以及应当由著作权人享有的其他可转让权利无偿独家转让给【嘻格格】运营商所有，同时表明该商户许可【嘻格格】有权利就任何主体侵权而单独提起诉讼，并获得全部赔偿。本协议已经构成《著作权法》或者相关法律法规所规定的书面协议，其效力及于商户在【嘻格格】发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。<br><br>

7.2 【嘻格格】拥有此服务平台内容及资源的版权,受国家知识产权保护,享有对服务平台各种协议、声明的修改权；未经【嘻格格】的明确书面许可，任何第三方不得为任何非私人或商业目的获取或使用本服务平台的任何部分或通过本服务平台可直接或间接获得的任何内容、服务或资料。任何第三方违反本协议的规定以任何方式，和/或以任何文字对本服务平台的任何部分进行发表、复制、转载、更改、引用、链接、下载或以其他方式进行使用，或向任何其他第三方提供获取本服务平台任何内容的渠道，则对本服务平台的使用权将立即终止，且任何第三方必须按照【嘻格格】的要求，归还或销毁使用本服务平台任何部分的内容所创建的资料的任何副本。<br><br>

7.3 【嘻格格】未向任何第三方转让本服务平台或其中的任何内容所相关的任何权益或所有权，且一切未明确向任何第三方授予的权利均归【嘻格格】所有。未经本协议明确允许而擅自使用本服务平台任何内容、服务或资料的，构成对本协议的违约行为，且可能触犯著作权、商标、专利和/或其他方面的法律法规，【嘻格格】保留对任何违反本协议规定的第三方（包括单位或个人等）提起法律诉讼的权利。<br><br>

第八条 适用法律与争议解决<br><br>

8.1 因商户使用【嘻格格】商户服务而引起或与之相关的一切争议均应依照中华人民共和国大陆地区法律（不包括冲突法）予以处理，并以乙方所在地人民法院为管辖法院。<br><br>

8.2 如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部分则仍具有法律效力。<br><br>

8.3 【嘻格格】于商户过失或违约时未行使本协议规定的权利的，不得视为其对商户的其他或以后同类之过失或违约行为弃权。<br><br>
        </div>
        <!-- <div @click="select" style="margin-left:4%;margin-top:32px">
            <img src="../../static/img/icon/sel@2x.png" alt="" style="width:24px;height:24px;display:inline-block" v-if="btn==1"><img src="../../static/img/icon/unsel@2x.png" alt="" style="width:24px;height:24px;display:inline-block" v-else><p style="display:inline-block;vertical-align:top;margin-left:6%">我同意。。。。。。。。。</p>
        </div> -->
        <div class="button" @click="submit"></div>
        <div style="height:37px"></div>
        </div>
    </div>
</template>

<script>
import { mapActions } from 'vuex'
export default {
    components:{

    },
    data(){
        return{
        //    data:JSON.parse(this.$route.query.data),
        //    btn:1
            m_number:this.$route.query.m_number,
            data:{}
        }
    },
    methods:{
        // select(){
        //     if(this.btn==1){
        //         this.btn=0
        //     }else{
        //         this.btn=1
        //     }
        // },
        submit(){
            // this.$http.post(`${this.rootPath}/Merchants/createSigning?m_number=${this.data.m_number}&is_signing=1`).
            let data=new FormData()
            data.append('m_number',this.data.m_number)
            data.append('is_signing',1)
            this.$http({
                method: 'post',
                url: `${this.rootPath}/Merchants/createSigning`,
                header: {
                    'Content-Type':'multipart/form-data'  
                },
                data: data
                }).then(res=>{
                console.log(res)
                if(res.data.StatusInfo.success){
                    this.$vux.toast.text('签约成功', 'top')
                    this.$router.push('/merchantsigned')
                }else{
                    this.$vux.toast.text('签约失败，请重试', 'top')
                }
            })
            // this.$vux.toast.text('签约成功', 'top')
            // this.$router.push('/merchantagreement')
        },
        getinfo(){
            this.$http.get(`${this.rootPath}/Merchants/getSinginInfo?m_number=${this.m_number}`).then(res=>{
            console.log(res)
            this.data=res.data.merchantsInfo
            // if(res.data.StatusInfo.ReturnCode==200){
            //     this.$nextTick(()=>{
            //         this.goodsInfo=res.data.goodsInfo
            //         this.goodsCateTree=res.data.goodsCateTree
            //         this.videoList=res.data.videoList
            //     })
            // }
            })
        }
    },
    mounted(){
        console.log(this.$route.query.data)
        console.log(this.data)
    },
    watch:{
        
    }
}
</script>

<style scoped>
.background{background: url('../../static/img/icon/background@2x.png') no-repeat center;width:100%;height:276px;padding-top: 54px;background-size:100% 100% }
.background div{color: #fff;text-align: center}
.button{background: url('../../static/img/icon/sign.png') no-repeat center;background-size:100% 100%;width:46%;margin-left:27%;height:70px;margin-top:37px;background-color:#fff;}
.vux-x-icon {
  fill: #E5E5E5;
}
</style>
